In [31]:
import pandas as pd
import matplotlib.pyplot as plt

In [32]:
def read_files():
    xlsx = pd.ExcelFile('ArriendoVehiculos.xlsx')

    df_set_1 = pd.read_excel(xlsx, 'Set de Datos 1', engine='openpyxl', index_col=None)
    df_set_2 = pd.read_excel(xlsx, 'Set de Datos 2', engine='openpyxl', index_col=None)
    df_set_3 = pd.read_excel(xlsx, 'Set de Datos 3', engine='openpyxl', index_col=None)
    
    return df_set_1, df_set_2, df_set_3

In [33]:
def show_df_info(df):
    print(df.info())
    display(df.head())

In [34]:
df_set_1, df_set_2, df_set_3 = read_files()
show_df_info(df_set_1)
show_df_info(df_set_2)
show_df_info(df_set_3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   EDAD                  49 non-null     float64
 1   GÉNERO                50 non-null     object
 2   ACTIVIDAD             49 non-null     object
 3   COMUNA DE RESIDENCIA  50 non-null     object
 4   MARCA                 49 non-null     object
 5   MODELO                50 non-null     object
 6   KILOMETRAJE INICIAL   50 non-null     int64
 7   KILOMETRAJE FINAL     50 non-null     int64
 8   CANTIDAD DIAS         49 non-null     float64
 9   MONTO                 50 non-null     int64
dtypes: float64(2), int64(3), object(5)
memory usage: 4.0+ KB
None

,EDAD,GÉNERO,ACTIVIDAD,COMUNA DE RESIDENCIA,MARCA,MODELO,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
0,36.0,MASCULINO,ESTUDIANTE,QUILLOTA,SUBARU,XV,2732,2866,4.0,80000
1,29.0,FEMENINO,DEPENDIENTE,VILLA ALEMANA,CITROEN,BERLINGO,2471,2637,3.0,30000
2,54.0,FEMENINO,DEPENDIENTE,CASABLANCA,FIAT,FULLBACK,3903,4092,4.0,80000
3,70.0,FEMENINO,DEPENDIENTE,OLMUE,HYUNDAY,SANTA FE,4196,4253,3.0,60000
4,39.0,FEMENINO,DEPENDIENTE,VALPARAISO,HYUNDAY,ACCENT,3113,3318,5.0,100000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            50 non-null     int64
 1   GÉNERO                49 non-null     object
 2   ACTIVIDAD             48 non-null     object
 3   COMUNA DE RESIDENCIA  50 non-null     object
 4   MARCA                 47 non-null     object
 5   MODELO                50 non-null     object
 6   KILOMETRAJE INICIAL   50 non-null     int64
 7   KILOMETRAJE FINAL     50 non-null     int64
 8   CANTIDAD DIAS         50 non-null     int64
 9   MONTO                 50 non-null     int64
dtypes: int64(5), object(5)
memory usage: 4.0+ KB
None

,Unnamed: 0,GÉNERO,ACTIVIDAD,COMUNA DE RESIDENCIA,MARCA,MODELO,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
0,52,MUJER,EMPRESARIO,QUILLOTA,HYUNDAY,SANTA FE,2186,2288,2,20000
1,47,MUJER,DEPENDIENTE,QUILPUE,SUZUKI,NOMADE,2916,3011,2,40000
2,25,HOMBRE,DEPENDIENTE,OLMUE,KIA,FRONTIER,2356,2427,3,30000
3,22,HOMBRE,DEPENDIENTE,VILLA ALEMANA,SUZUKI,NOMADE,3464,3684,4,120000
4,58,MUJER,ESTUDIANTE,QUILPUE,SUBARU,XV,4080,4157,4,80000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   EDAD                  50 non-null     int64
 1   GÉNERO                50 non-null     object
 2   ACTIVIDAD             49 non-null     object
 3   COMUNA DE RESIDENCIA  50 non-null     object
 4   MARCA                 47 non-null     object
 5   MODELO                50 non-null     object
 6   KILOMETRAJE INICIAL   50 non-null     int64
 7   KILOMETRAJE FINAL     50 non-null     int64
 8   CANTIDAD DIAS         50 non-null     int64
 9   MONTO                 50 non-null     int64
dtypes: int64(5), object(5)
memory usage: 4.0+ KB
None

,EDAD,GÉNERO,ACTIVIDAD,COMUNA DE RESIDENCIA,MARCA,MODELO,KILOMETRAJE INICIAL,KILOMETRAJE FINAL,CANTIDAD DIAS,MONTO
0,36,FEMENINO,DEPENDIENTE,OLMUE,FORD,ESCAPE,3201,3265,1,30000
1,29,FEMENINO,DEPENDIENTE,CASABLANCA,FORD,ESCAPE,2399,2563,4,120000
2,54,MASCULINO,DEPENDIENTE,VILLA ALEMANA,FIAT,FULLBACK,3266,3385,3,90000
3,70,MASCULINO,DEPENDIENTE,VIÑA DEL MAR,RENAULT,CAPTUR,3965,4022,1,-20000
4,39,MASCULINO,DEPENDIENTE,OLMUE,MAZDA,6,2642,2847,2,40000